import streamlit as st

st.set_page_config(page_title="гдз по математике 5 класс", page_icon="https://cdn-icons-png.flaticon.com/512/4775/4775505.png", layout="wide")
st.title("привет брат ладно я помогу тебе (нет) но учти считать ты должен/должна будешь сам(а)")

tab1 , tab2 , tab3 , tab4 = st.tabs (["одумайся", "Первая часть О. Истер", "Вторая часть О.Истер", "Крутые игры(Дз)"])

with tab1:
    st.header("ну брат ну пойми списывать плохо, а что если мама тебя спросить сколько будет 5+5 что ты ей ответишь? 9? 67? ну ребенок возьми как минимум калькулятор, там же не настолько всё плохо, умоляю тебя, не тупей на моих глазах")

with tab2:
    st.header("слушай сюда")
    col1, col2 = st.columns([1, 2])
    with col1:
      st.image("https://i.pinimg.com/236x/56/47/b4/5647b4d16d97b9f760738e0c2ca221bc.jpg", width=350 , caption="Видишь что тебе кроля говорит?")

      with col2:
        st.subheader("Я же сказал уже ранее, надо самому учить учить всё")
        st.write("А как ты потом нмт сдашь? а зно? родители не будут тебя на шее держать, наивный")
        st.write("вот и всё, обламался твой план")
        with st.container():
            st.info("ВСЁ! я пошел звонить твоим родителям") # st.error() st.warning() st.success
            st.markdown("- Номер мамы: (676767676767)")
            st.markdown("- Номер папы: (525252525252)")
        st.write("А надо было раньше")

with tab3:
    st.header("извини но нет. не нарывайся иначе щас бабушке твоей позвоню")

with tab4:
    st.title("Попробуй поиграть в эти игры, не делай дз")
    st.write("Да это роблокс, тебе понравится")

    col1, col2 = st.columns([1, 2])
    with col1:
        st.write("Причины зайти:")
        st.write("1. Переход на дроби и проценты: В 5 классе дети знакомятся с обыкновенными и десятичными дробями, а также процентами. Это первые по-настоящему абстрактные понятия, которые используются повсеместно — от расчета скидок в магазине до финансовых расчетов. 2. Преодоление первого учебного кризиса: Именно в 5 классе часто происходит «школьный перелом»: меняются учителя, возрастает объем информации, а требования становятся строже. Регулярная работа с математикой помогает развить самодисциплину и не запустить учебу на старте средней школы. 3. База для физики, химии и алгебры: Без уверенного счета, умения решать уравнения и работать с текстовыми задачами в 7 классе ребенок столкнется с непреодолимыми трудностями в физике, химии и геометрии. Проблемы в точных науках чаще всего начинаются именно с пробелов за 5–6 классы. 4. Тренировка логического и системного мышления: В этом возрасте задачи усложняются: нужно не просто посчитать в уме, а составить алгоритм, выделить главное и проверить решение. Это учит мозг структурировать хаотичную информацию. 5. Формирование характера и усидчивости: Многошаговые примеры и объемные текстовые задачи требуют терпения. Решение сложных примеров тренирует волю, внимание и привычку доводить начатое дело до конца, даже если ответ не сходится с первого раза.")

    with col2:
        st.header("Ссылки")
        st.markdown("https://learning.ua/matematyka/piatyi-klas/okruhlennia-chysel")
        st.markdown("https://learning.ua/matematyka/piatyi-klas/sortuvannia-chysel")
        st.markdown("https://learning.ua/matematyka/piatyi-klas/dodavannia-ta-vidnimannia-u-stovpchyk-5kl")
        st.markdown("https://learning.ua/matematyka/piatyi-klas/nerivnosti-z-dodavanniam")
        st.markdown("https://learning.ua/matematyka/piatyi-klas/mnozhennia-u-stovpchyk-do-10-000")
        st.markdown("https://learning.ua/matematyka/piatyi-klas/mnozhennia-kruhlykh-chysel")