import streamlit as st

st.set_page_config(page_title="гдз по математике 5 класс", page_icon="https://cdn-icons-png.flaticon.com/512/4775/4775505.png", layout="wide")
st.title("привет брат ладно я помогу тебе (нет) но учти считать ты должен/должна будешь сам(а)")

tab1 , tab2 , tab3 = st.tabs (["одумайся", "Первая часть О. Истер", "Вторая часть О.Истер"])

with tab1:
    st.header("ну брат ну пойми списывать плохо, а что если мама тебя спросить сколько будет 5+5 что ты ей ответишь? 9? 67? ну ребенок возьми как минимум калькулятор, там же не настолько всё плохо, умоляю тебя, не тупей на моих глазах")

with tab2:
    st.header("слушай сюда")
    col1, col2 = st.columns([1, 2])
    with col1:
      st.image("https://i.pinimg.com/236x/56/47/b4/5647b4d16d97b9f760738e0c2ca221bc.jpg", width=350 , caption="Видишь что тебе кроля говорит?")

      with col2:
        st.subheader("Я же сказал уже ранее, надо самому учить учить всё")
        st.write("А как ты потом нмт сдашь? а зно? родители не будут тебя на шее держать, наивный")
        st.write("вот и всё, обламался твой план")
        with st.container():
            st.info("ВСЁ! я пошел звонить твоим родителям") # st.error() st.warning() st.success
            st.markdown("- Номер мамы: (676767676767)")
            st.markdown("- Номер папы: (525252525252)")
        st.write("А надо было раньше")

with tab3:
    st.header("извини но нет. не нарывайся иначе щас бабушке твоей позвоню")